In [1]:
#Exp_no:3

In [2]:
#Aim:To Create The Dataframe

In [4]:
#Name:Mohini Rajesh Ganjare
#Roll no:16
#Sec:B
#Sub:ET1
#Date:07/08/2025

# Creating a Series

In [5]:
#importing the basic library
import pandas as pd

In [6]:
#Creating Student Name list
Name=["Saniya","Rachel","Deep","Anaya"]

In [7]:
Name

['Saniya', 'Rachel', 'Deep', 'Anaya']

In [11]:
Rolllist=pd.Series(Name,index=[1,2,3,4])

In [12]:
print(Rolllist)

1    Saniya
2    Rachel
3      Deep
4     Anaya
dtype: object

# Creating a Data Frame

In [13]:
df=pd.DataFrame([[10,11,12,13],[14,15,16,17],[15,17,18,12],[20,27,26,13]],
               columns=["CD","DBMS","DSS","CAO"])

In [14]:
df

   CD  DBMS  DSS  CAO
0  10    11   12   13
1  14    15   16   17
2  15    17   18   12
3  20    27   26   13

In [15]:
df.shape

(4, 4)

In [16]:
df.size

16

In [17]:
df.ndim

2

In [18]:
df2=pd.DataFrame([[9,12,10,11]],
 columns=["CD","DBMS","DSS","CAO"])

In [19]:
df2

   CD  DBMS  DSS  CAO
0   9    12   10   11

In [21]:
df3=pd.concat([df,df2] ,ignore_index=True)

In [22]:
df3

   CD  DBMS  DSS  CAO
0  10    11   12   13
1  14    15   16   17
2  15    17   18   12
3  20    27   26   13
4   9    12   10   11

In [23]:
df2.size

4

In [24]:
df2.shape

(1, 4)

In [25]:
df3.size

20

In [26]:
df3.shape

(5, 4)

# Adding Records (Columns) From Data Frame

In [27]:
df3["DM"]=[11,12,13,14,15]

In [28]:
df3

   CD  DBMS  DSS  CAO  DM
0  10    11   12   13  11
1  14    15   16   17  12
2  15    17   18   12  13
3  20    27   26   13  14
4   9    12   10   11  15

# Deleting Records (Row) From Data Frame

In [29]:
df4=df3.drop(index=[1])

In [30]:
df4

   CD  DBMS  DSS  CAO  DM
0  10    11   12   13  11
2  15    17   18   12  13
3  20    27   26   13  14
4   9    12   10   11  15

# Deleting attribute From df3

In [31]:
df5=df3.drop(columns=['DM'])

In [32]:
df5

   CD  DBMS  DSS  CAO
0  10    11   12   13
1  14    15   16   17
2  15    17   18   12
3  20    27   26   13
4   9    12   10   11

In [33]:
# finding mean of dss
print("Mean of Dss:",df4["DSS"].mean())

Mean of Dss: 16.5

In [34]:
# finding median of dss
print("Median of Dss:",df4["DSS"].median())

Median of Dss: 15.0

In [35]:
# finding mode of dss
print("Mode of Dss:",df4["DSS"].mode())

Mode of Dss: 0    10
1    12
2    18
3    26
Name: DSS, dtype: int64

In [36]:
df4

   CD  DBMS  DSS  CAO  DM
0  10    11   12   13  11
2  15    17   18   12  13
3  20    27   26   13  14
4   9    12   10   11  15

In [37]:
# finding mean of dss
print("Mean of Dss:",df5["DSS"].mean())

Mean of Dss: 16.4

In [38]:
# finding median of dss
print("Median of Dss:",df5["DSS"].median())

Median of Dss: 16.0

In [39]:
# finding mode of dss
print("Mode of Dss:",df4["DSS"].mode())

Mode of Dss: 0    10
1    12
2    18
3    26
Name: DSS, dtype: int64